; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-1-1-2-2-3-8) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 distributor0)
	(clear crate7)
	(at truck0 distributor0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 depot0)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 depot0)
	(on crate2 crate1)
	(at crate3 distributor0)
	(on crate3 crate0)
	(at crate4 distributor0)
	(on crate4 crate3)
	(at crate5 depot0)
	(on crate5 crate2)
	(at crate6 depot0)
	(on crate6 crate5)
	(at crate7 distributor0)
	(on crate7 crate4)
)

(:goal (and
		(on crate0 crate6)
		(on crate2 crate3)
		(on crate3 pallet1)
		(on crate4 crate7)
		(on crate5 crate2)
		(on crate6 crate5)
		(on crate7 pallet0)
	)
))

; plan
1. (lift hoist1 crate7 crate4 distributor0)
   deleted: (at crate7 distributor0) (available hoist1) (on crate7 crate4) (clear crate7)
   added: (lifting hoist1 crate7) (clear crate4)
   goals met: 2 of 7
2. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   goals met: 2 of 7
3. (lift hoist1 crate4 crate3 distributor0)
   deleted: (at crate4 distributor0) (available hoist1) (on crate4 crate3) (clear crate4)
   added: (lifting hoist1 crate4) (clear crate3)
   goals met: 2 of 7
4. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 2 of 7
5. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 2 of 7
6. (unload hoist0 crate7 truck0 depot0)
   deleted: (available hoist0) (in crate7 truck0)
   added: (lifting hoist0 crate7)
   goals met: 2 of 7
7. (lift hoist2 crate6 crate5 depot0)
   deleted: (at crate6 depot0) (available hoist2) (on crate6 crate5) (clear crate6)
   added: (lifting hoist2 crate6) (clear crate5)
   goals met: 1 of 7
8. (load hoist2 crate6 truck0 depot0)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   goals met: 1 of 7
9. (lift hoist2 crate5 crate2 depot0)
   deleted: (at crate5 depot0) (available hoist2) (on crate5 crate2) (clear crate5)
   added: (lifting hoist2 crate5) (clear crate2)
   goals met: 0 of 7
10. (load hoist2 crate5 truck0 depot0)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   goals met: 0 of 7
11. (lift hoist2 crate2 crate1 depot0)
   deleted: (at crate2 depot0) (available hoist2) (on crate2 crate1) (clear crate2)
   added: (lifting hoist2 crate2) (clear crate1)
   goals met: 0 of 7
12. (load hoist2 crate2 truck0 depot0)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 0 of 7
13. (lift hoist2 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (available hoist2) (on crate1 pallet0) (clear crate1)
   added: (lifting hoist2 crate1) (clear pallet0)
   goals met: 0 of 7
14. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (at crate7 depot0) (available hoist0) (on crate7 pallet0) (clear crate7)
   goals met: 1 of 7
15. (unload hoist0 crate4 truck0 depot0)
   deleted: (available hoist0) (in crate4 truck0)
   added: (lifting hoist0 crate4)
   goals met: 1 of 7
16. (lift hoist1 crate3 crate0 distributor0)
   deleted: (at crate3 distributor0) (available hoist1) (on crate3 crate0) (clear crate3)
   added: (lifting hoist1 crate3) (clear crate0)
   goals met: 1 of 7
17. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 1 of 7
18. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (available hoist1) (on crate0 pallet1) (clear crate0)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 1 of 7
19. (drop hoist0 crate4 crate7 depot0)
   deleted: (lifting hoist0 crate4) (clear crate7)
   added: (at crate4 depot0) (available hoist0) (on crate4 crate7) (clear crate4)
   goals met: 2 of 7
20. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 2 of 7
21. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 2 of 7
22. (unload hoist1 crate3 truck1 distributor0)
   deleted: (available hoist1) (in crate3 truck1)
   added: (lifting hoist1 crate3)
   goals met: 2 of 7
23. (drop hoist1 crate3 pallet1 distributor0)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (at crate3 distributor0) (available hoist1) (on crate3 pallet1) (clear crate3)
   goals met: 3 of 7
24. (unload hoist1 crate2 truck0 distributor0)
   deleted: (available hoist1) (in crate2 truck0)
   added: (lifting hoist1 crate2)
   goals met: 3 of 7
25. (drop hoist1 crate2 crate3 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate3)
   added: (at crate2 distributor0) (available hoist1) (on crate2 crate3) (clear crate2)
   goals met: 4 of 7
26. (unload hoist1 crate5 truck0 distributor0)
   deleted: (available hoist1) (in crate5 truck0)
   added: (lifting hoist1 crate5)
   goals met: 4 of 7
27. (drop hoist1 crate5 crate2 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate2)
   added: (at crate5 distributor0) (available hoist1) (on crate5 crate2) (clear crate5)
   goals met: 5 of 7
28. (unload hoist1 crate6 truck0 distributor0)
   deleted: (available hoist1) (in crate6 truck0)
   added: (lifting hoist1 crate6)
   goals met: 5 of 7
29. (drop hoist1 crate6 crate5 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate5)
   added: (at crate6 distributor0) (available hoist1) (on crate6 crate5) (clear crate6)
   goals met: 6 of 7
30. (unload hoist1 crate0 truck0 distributor0)
   deleted: (available hoist1) (in crate0 truck0)
   added: (lifting hoist1 crate0)
   goals met: 6 of 7
31. (drop hoist1 crate0 crate6 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate6)
   added: (at crate0 distributor0) (available hoist1) (on crate0 crate6) (clear crate0)
   goals met: 7 of 7
